{
	"version": "https://jsonfeed.org/version/1",
	"title": "learning to fly.",
	"icon": "https://micro.blog/rushhour/avatar.jpg",
	"home_page_url": "https://jze.ng/",
	"feed_url": "https://jze.ng/feed.json",
	"items": [
		
			{
				"id": "http://rushhour.micro.blog/2023/06/21/143504.html",
				
				"content_html": "<p><img src=\"uploads/2023/3340a6922d.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/af2c318f9b.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/img-4084.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/d503921472.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/555562eb94.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/d0776ff379.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/368c3dfa0a.jpg\" width=\"600\" height=\"450\" alt=\"\"></p>\n",
				"content_text": "\n\n<img src=\"uploads/2023/3340a6922d.jpg\" width=\"600\" height=\"450\" alt=\"\"><img src=\"uploads/2023/af2c318f9b.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/img-4084.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/d503921472.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/555562eb94.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/d0776ff379.jpg\" width=\"450\" height=\"600\" alt=\"\"><img src=\"uploads/2023/368c3dfa0a.jpg\" width=\"600\" height=\"450\" alt=\"\">\n",
				"date_published": "2023-06-21T14:35:04-04:00",
				"url": "https://jze.ng/2023/06/21/143504.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/16/im-trying-to.html",
				
				"content_html": "<p>i&rsquo;m trying to get through the dark on a feeling, relying only on instinct</p>\n",
				"content_text": "i'm trying to get through the dark on a feeling, relying only on instinct\n",
				"date_published": "2023-06-16T16:49:15-04:00",
				"url": "https://jze.ng/2023/06/16/im-trying-to.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/14/dreamer.html",
				"title": "dreamer",
				"content_html": "<p>I&rsquo;m an idealist and a realist. I&rsquo;m a dreamer grounded in reality. I don&rsquo;t have to dream to make it beautiful. Everything I do is beautiful. I can see my dreams. And they stare back. I know how I will get to the stars. It&rsquo;s not hopeless. I know when you call me a dreamer, it means that you don&rsquo;t believe me.</p>\n<p>There&rsquo;s a certain kind of certainty that makes some people so sure that someone else will succeed. I don&rsquo;t think I possess that aura, but I still rationally believe in my own success. When people say I&rsquo;m a dreamer, I feel demeaned. I can see my future there. I can see the steps to get there. Why do you think I can&rsquo;t climb up? I just have to go up and grab it. It&rsquo;s not that hard is it?</p>\n<p>Everyone thinks I&rsquo;m crazy. I think I&rsquo;m perfectly normal. Everyone else is insane.</p>\n",
				"content_text": "I'm an idealist and a realist. I'm a dreamer grounded in reality. I don't have to dream to make it beautiful. Everything I do is beautiful. I can see my dreams. And they stare back. I know how I will get to the stars. It's not hopeless. I know when you call me a dreamer, it means that you don't believe me. \n\nThere's a certain kind of certainty that makes some people so sure that someone else will succeed. I don't think I possess that aura, but I still rationally believe in my own success. When people say I'm a dreamer, I feel demeaned. I can see my future there. I can see the steps to get there. Why do you think I can't climb up? I just have to go up and grab it. It's not that hard is it?\n\nEveryone thinks I'm crazy. I think I'm perfectly normal. Everyone else is insane.\n\n",
				"date_published": "2023-06-14T14:02:07-04:00",
				"url": "https://jze.ng/2023/06/14/dreamer.html",
				"tags": ["thought","essay","rant"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/14/theres-a-moment.html",
				
				"content_html": "<blockquote>\n<p>“There&rsquo;s a moment on the arch of a jump, when you are neither rising nor falling. All you can see is the sky. All you can feel is the air and all you can hear is your heartbeat. That is all you are. Muscle and motion. It&rsquo;s called the deadpoint. I live for that.”</p>\n<p>― <cite>Rhianna Pratchett, Mirror&rsquo;s Edge</cite></p>\n</blockquote>\n<p>before pigeons fly, they take a little leap, knowing that their wings will work. if i dont jump, how will i ever fly? and sometimes, when i have no courage, when there are no words or actions that can soothe me, i just jump. i take a leap of faith. i trust myself to make it. to land safely, in one spot. i jump over my obstacles, my fears, over barriers others place in my wake.</p>\n",
				"content_text": "> “There's a moment on the arch of a jump, when you are neither rising nor falling. All you can see is the sky. All you can feel is the air and all you can hear is your heartbeat. That is all you are. Muscle and motion. It's called the deadpoint. I live for that.”\n>\n> ― <cite>Rhianna Pratchett, Mirror's Edge</cite>\n\nbefore pigeons fly, they take a little leap, knowing that their wings will work. if i dont jump, how will i ever fly? and sometimes, when i have no courage, when there are no words or actions that can soothe me, i just jump. i take a leap of faith. i trust myself to make it. to land safely, in one spot. i jump over my obstacles, my fears, over barriers others place in my wake. \n",
				"date_published": "2023-06-14T13:16:45-04:00",
				"url": "https://jze.ng/2023/06/14/theres-a-moment.html",
				"tags": ["quotes"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/13/i-like-being.html",
				
				"content_html": "<p>i like being underdog</p>\n<p>just a boy from hillbilly new hampshire</p>\n",
				"content_text": "i like being underdog\n\njust a boy from hillbilly new hampshire\n",
				"date_published": "2023-06-13T05:02:35-04:00",
				"url": "https://jze.ng/2023/06/13/i-like-being.html",
				"tags": ["thought"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/13/everyone-keeps-telling.html",
				
				"content_html": "<blockquote>\n<p>“Everyone keeps telling me how my story is supposed to go. Nah, I&rsquo;m gonna do my own thing.”</p>\n<p>― <cite>Miles Morales</cite></p>\n</blockquote>\n<p>no one ever takes me seriously. no one believes me. i want to climb a mountain. i want to reach the highest peak. it&rsquo;s hard though, when no one is there to support you at any given interval. but, i will live. and there&rsquo;s no one to stop me. i&rsquo;m more capable than i can even imagine.</p>\n<p>sometimes i think if there was just one person who would genuinely believe in me, and i wonder how much i could achieve. just one star would light up the infinite night.</p>\n<p>why does it matter what anyone else says. they would say it anyway.</p>\n<p>i want to be right in the things i care about. i want it that way. i want to look at the crowds that gather around me and know that they are are as unnecessary as they were when they gathered around someone else, when i was alone. i will prevail, despite everything.</p>\n<p>i just have to remind myself of that occasionally, because no one else ever does</p>\n",
				"content_text": "> “Everyone keeps telling me how my story is supposed to go. Nah, I'm gonna do my own thing.”\n>\n> ― <cite>Miles Morales</cite>\n\nno one ever takes me seriously. no one believes me. i want to climb a mountain. i want to reach the highest peak. it's hard though, when no one is there to support you at any given interval. but, i will live. and there's no one to stop me. i'm more capable than i can even imagine.\n\nsometimes i think if there was just one person who would genuinely believe in me, and i wonder how much i could achieve. just one star would light up the infinite night. \n\nwhy does it matter what anyone else says. they would say it anyway. \n\ni want to be right in the things i care about. i want it that way. i want to look at the crowds that gather around me and know that they are are as unnecessary as they were when they gathered around someone else, when i was alone. i will prevail, despite everything. \n\ni just have to remind myself of that occasionally, because no one else ever does\n",
				"date_published": "2023-06-13T02:12:00-04:00",
				"url": "https://jze.ng/2023/06/13/everyone-keeps-telling.html",
				"tags": ["thought","quotes"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/13/ignorance-is-a.html",
				"title": "a double edged sword",
				"content_html": "<p>ignorance is really a blessing and a curse</p>\n<p>in new hampshire, home to the rednecks, among the sea of trailer parks, i lived and witnessed contentment in simplicity. if you only lived there, you would feel fulfilled. the air was filled with the delicious aroma of barbeques, the laughter and cheers of football games, and people drinking beers on their porch. the background music of daily life wasn&rsquo;t so bad. leave once and come back and you notice the toxic words in their voices, the loop of marriages and divorces, the blissful unawareness that the world offered anything beyond their community, their trailer parks, their mcdonalds.</p>\n<p>i shifted gears and found myself in san francisco, where ambition was currency. here, the proximity to stanford, the budding startups, the towering tech companies had everyone in a frenzy to chase their most audacious dreams, like insects to a light. i felt like life was a race where only grandiose aspirations where the only things to be proud of. relentless pursuit lead to people losing sight of grounded realities. flying too high, just to fall to earth, leaving only a whimper behind.</p>\n<p>new york city was a different beast altogether. the hustle and bustle of a melting pot, where people from all corners of the globe flocked with dreams in their eyes. people would search for the simple stability that seemed a luxury from their immigrant home countries. unbeknownst to them, the city had its own undertows and currents ready to tear them apart. i can&rsquo;t count the number of parents that gave their entire life to their children.</p>\n<p>kids from my town would always peak in high school. they thought life was so cool as a kid, just fooling around. they could see from their parents what kind of fate would be awaiting them, but it&rsquo;s like they just turned a blind eye to it. in san francisco, kids would think life is comprised of only big dreams. that you have to make it big or go home a loser. where risk is all there is to life, and then they aim big and fall harder. and in new york, the immigrant kids are all primed to want a stable life, too afraid to conquer the world, too afraid to leave the city.</p>\n<p>then there are those that have never experienced a healthy love, a healthy family, healthy relationships. how would you even know magical things exist if you don&rsquo;t experience them? people never do a good enough job explaining magic to others. if they did, people wouldn&rsquo;t make so many dumb mistakes.</p>\n<p>and then there&rsquo;s me. i&rsquo;ve fallen into all of these traps :) who knows how i&rsquo;ll end up? and maybe i&rsquo;m the most ignorant, i want the best of all three of these worlds.</p>\n<hr>\n<p>and then there are the perfectly fine people. born into a stable family. pushed into taking their education seriously. have a fine career and family. love and are loved. happy. i guess they&rsquo;re happy.</p>",
				"content_text": "ignorance is really a blessing and a curse\n\n<!--more-->\n\nin new hampshire, home to the rednecks, among the sea of trailer parks, i lived and witnessed contentment in simplicity. if you only lived there, you would feel fulfilled. the air was filled with the delicious aroma of barbeques, the laughter and cheers of football games, and people drinking beers on their porch. the background music of daily life wasn't so bad. leave once and come back and you notice the toxic words in their voices, the loop of marriages and divorces, the blissful unawareness that the world offered anything beyond their community, their trailer parks, their mcdonalds.\n\ni shifted gears and found myself in san francisco, where ambition was currency. here, the proximity to stanford, the budding startups, the towering tech companies had everyone in a frenzy to chase their most audacious dreams, like insects to a light. i felt like life was a race where only grandiose aspirations where the only things to be proud of. relentless pursuit lead to people losing sight of grounded realities. flying too high, just to fall to earth, leaving only a whimper behind.\n\nnew york city was a different beast altogether. the hustle and bustle of a melting pot, where people from all corners of the globe flocked with dreams in their eyes. people would search for the simple stability that seemed a luxury from their immigrant home countries. unbeknownst to them, the city had its own undertows and currents ready to tear them apart. i can't count the number of parents that gave their entire life to their children.\n\nkids from my town would always peak in high school. they thought life was so cool as a kid, just fooling around. they could see from their parents what kind of fate would be awaiting them, but it's like they just turned a blind eye to it. in san francisco, kids would think life is comprised of only big dreams. that you have to make it big or go home a loser. where risk is all there is to life, and then they aim big and fall harder. and in new york, the immigrant kids are all primed to want a stable life, too afraid to conquer the world, too afraid to leave the city.\n\nthen there are those that have never experienced a healthy love, a healthy family, healthy relationships. how would you even know magical things exist if you don't experience them? people never do a good enough job explaining magic to others. if they did, people wouldn't make so many dumb mistakes.\n\nand then there's me. i've fallen into all of these traps :) who knows how i'll end up? and maybe i'm the most ignorant, i want the best of all three of these worlds.\n\n----------\n\nand then there are the perfectly fine people. born into a stable family. pushed into taking their education seriously. have a fine career and family. love and are loved. happy. i guess they're happy.\n",
				"date_published": "2023-06-13T01:16:18-04:00",
				"url": "https://jze.ng/2023/06/13/ignorance-is-a.html",
				"tags": ["thought","essay","rant"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/13/going-about-the.html",
				"title": "going about the motions",
				"content_html": "<p>this is a poem &ldquo;dreamlessly&rdquo; by charles bukowski. it&rsquo;s about the people in life who have given up. i found it from john weiss' <a href=\"https://medium.com/personal-growth/life-is-so-terrible-and-beautiful-at-the-same-time-a2254b08df20\">most recent blog post</a>. i think it such a tragic fate, to know your dreams have fallen from your grasp, and to wander dreamlessly.</p>\n<p><em>Dreamlessly</em> <br>\nOld, grey-haired waitresses     <br>\nin cafes at night    <br>\nhave given it up,      <br>\nand as I walk down sidewalks of  <br>\nlight and look into windows <br>\nof nursing homes <br>\nI can see that it is no longer<br>\nwith them. <br>\nI see people sitting on park benches<br>\nand I can see by the way they <br>\nsit and look   <br>\nthat it is gone.</p>\n<p>I see people driving cars <br>\nand I see by the way  <br>\nthey drive their cars <br>\nthat they neither love nor are <br>\nloved - <br>\nnor do they consider <br>\nsex. It is all forgotten<br>\nlike an old movie.</p>\n<p>I see people in department stores and<br>\nsupermarkets<br>\nwalking down aisles<br>\nbuying things <br>\nand I can see by the way their clothing<br>\nfits them and by the way they walk<br>\nand by their faces and their eyes<br>\nthat they care for nothing<br>\nand that nothing cares <br>\nfor them. <br>\nI see a hundred people a day<br>\nwho have given up <br>\nentirely.</p>\n<p>If I go to the racetrack <br>\nor a sporting event <br>\nI can see thousands <br>\nthat feel for nothing or <br>\nno one <br>\nand get no feeling <br>\nback.</p>\n<p>Everywhere I see those who<br>\ncrave nothing but <br>\nfood, shelter, and <br>\nclothing; they concentrate <br>\non that,  <br>\ndreamlessly</p>\n<p>I do not understand why these people do not <br>\nvanish <br>\nI do not understand why these people do not<br>\nexpire<br>\nwhy the clouds<br>\ndo not murder them<br>\nor why the dogs<br>\ndo not murder them<br>\nor why the flowers and the children <br>\ndo not murder them, <br>\nI do not understand. <br>\nI suppose they are murdered <br>\nyet I can’t adjust to the <br>\nfact of them <br>\nbecause they are so many.</p>\n<p>Each day, <br>\neach night, <br>\nthere are more of them <br>\nin the subways and <br>\nin the buildings and <br>\nin the parks</p>\n<p>they feel no terror <br>\nat not loving<br>\nor at not <br>\nbeing loved</p>\n<p>so many many many <br>\nof my fellow</p>\n<p>creatures</p>\n<hr>\n<p>this is such a scary fear. to have worked, but to have worked for nothing. to have loved, but loved for nothing. to have hoped, but hoped for nothing. and to have nothing to show for it, and nothing to live for it.</p>\n<p>and it&rsquo;s not like it just affects the poor, although it probably does, unproportionately. the rich just drive fast cars, not knowing where they&rsquo;re going. or maybe they were born like that, to no fault of their own.</p>\n<p>or maybe i&rsquo;m projecting. regardless, happiness and satisfication in the us is going down. it&rsquo;s tragic. i don&rsquo;t want to be wander dreamlessly. it would be so tragic.</p>\n<p>i want my life to have upwards momentum. i want to propel myself in a direction i would never regret. i want to dream. i want to love, and to be loved. i want to exist, not to just exist, but to exist for a reason, for myself, for someone.</p>\n<p>until an asteroid, <br>\njohnny</p>",
				"content_text": "this is a poem \"dreamlessly\" by charles bukowski. it's about the people in life who have given up. i found it from john weiss' [most recent blog post](https://medium.com/personal-growth/life-is-so-terrible-and-beautiful-at-the-same-time-a2254b08df20). i think it such a tragic fate, to know your dreams have fallen from your grasp, and to wander dreamlessly.\n\n<!--more-->\n\n*Dreamlessly*    \nOld, grey-haired waitresses        \nin cafes at night       \nhave given it up,         \nand as I walk down sidewalks of     \nlight and look into windows    \nof nursing homes    \nI can see that it is no longer   \nwith them.    \nI see people sitting on park benches   \nand I can see by the way they    \nsit and look      \nthat it is gone.       \n\nI see people driving cars    \nand I see by the way     \nthey drive their cars    \nthat they neither love nor are    \nloved -    \nnor do they consider    \nsex. It is all forgotten   \nlike an old movie.    \n\nI see people in department stores and   \nsupermarkets   \nwalking down aisles   \nbuying things    \nand I can see by the way their clothing   \nfits them and by the way they walk   \nand by their faces and their eyes   \nthat they care for nothing   \nand that nothing cares    \nfor them.    \nI see a hundred people a day   \nwho have given up    \nentirely.   \n\nIf I go to the racetrack    \nor a sporting event    \nI can see thousands    \nthat feel for nothing or    \nno one    \nand get no feeling    \nback.    \n\nEverywhere I see those who   \ncrave nothing but    \nfood, shelter, and    \nclothing; they concentrate    \non that,     \ndreamlessly     \n\nI do not understand why these people do not    \nvanish    \nI do not understand why these people do not   \nexpire   \nwhy the clouds   \ndo not murder them   \nor why the dogs   \ndo not murder them   \nor why the flowers and the children    \ndo not murder them,    \nI do not understand.    \nI suppose they are murdered    \nyet I can’t adjust to the    \nfact of them    \nbecause they are so many.    \n    \nEach day,    \neach night,    \nthere are more of them    \nin the subways and    \nin the buildings and    \nin the parks    \n    \nthey feel no terror    \nat not loving   \nor at not    \nbeing loved      \n\nso many many many    \nof my fellow    \n\ncreatures    \n\n---------------\n\nthis is such a scary fear. to have worked, but to have worked for nothing. to have loved, but loved for nothing. to have hoped, but hoped for nothing. and to have nothing to show for it, and nothing to live for it. \n\nand it's not like it just affects the poor, although it probably does, unproportionately. the rich just drive fast cars, not knowing where they're going. or maybe they were born like that, to no fault of their own. \n\nor maybe i'm projecting. regardless, happiness and satisfication in the us is going down. it's tragic. i don't want to be wander dreamlessly. it would be so tragic.\n\ni want my life to have upwards momentum. i want to propel myself in a direction i would never regret. i want to dream. i want to love, and to be loved. i want to exist, not to just exist, but to exist for a reason, for myself, for someone.\n\nuntil an asteroid,    \njohnny\n",
				"date_published": "2023-06-13T00:48:39-04:00",
				"url": "https://jze.ng/2023/06/13/going-about-the.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/09/statue.html",
				"title": "statue",
				"content_html": "<p>from ancient earth, where the very air shimmers with mystic dust, titanic golems stride forth and sinister gargoyles take wing through the stygian night. from the very core of the planet, i am born, a colossal monolith of stone, kin to the living earth, bound by sacred ties that have endured since the dawn of creation.</p>\n<p>unlike my brethren i differ; i bow to no crown, no scepter. the earth and i are one, and within her labyrinth depths, i am entombed in an eternal seam of bedrock and rare minerals.</p>\n<p>the rumblings of my awakening stir. the earth trembles as i prepare to emerge. i have a will with the soul of primeval forces, i unleash cataclysms - avalanches thunder across the land, rivers forsake their ancient paths, and shallow valleys become bottomless chasms.</p>\n<p>as the world quivers and quakes in awe, a silence descends, and through the swirling maelstrom of dust and stone, i emerge. with a mere shrug, i cast aside boulders colossal enough to fell mountains, as though tossing aside a light blanket. from the stones and the soils, i mold my form, taking the visage of a mortal beast.</p>\n<p>i am paragon of nature&rsquo;s wrath and a harbinger of her tender caresses. i am the sculptor, the artisan, and the chisel; a living statue.</p>\n<p>the prodigal son is here</p>\n",
				"content_text": "from ancient earth, where the very air shimmers with mystic dust, titanic golems stride forth and sinister gargoyles take wing through the stygian night. from the very core of the planet, i am born, a colossal monolith of stone, kin to the living earth, bound by sacred ties that have endured since the dawn of creation.\r\n\r\nunlike my brethren i differ; i bow to no crown, no scepter. the earth and i are one, and within her labyrinth depths, i am entombed in an eternal seam of bedrock and rare minerals.\r\n\r\nthe rumblings of my awakening stir. the earth trembles as i prepare to emerge. i have a will with the soul of primeval forces, i unleash cataclysms - avalanches thunder across the land, rivers forsake their ancient paths, and shallow valleys become bottomless chasms.\r\n\r\nas the world quivers and quakes in awe, a silence descends, and through the swirling maelstrom of dust and stone, i emerge. with a mere shrug, i cast aside boulders colossal enough to fell mountains, as though tossing aside a light blanket. from the stones and the soils, i mold my form, taking the visage of a mortal beast. \r\n\r\ni am paragon of nature's wrath and a harbinger of her tender caresses. i am the sculptor, the artisan, and the chisel; a living statue.\r\n\r\nthe prodigal son is here\n",
				"date_published": "2023-06-09T13:47:33-04:00",
				"url": "https://jze.ng/2023/06/09/statue.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/09/before-the-rise.html",
				
				"content_html": "<p>before the rise of the dawn, with the sun yet to greet. i am a drummer marching to my own beat. i am pacing myself on a marathon run. i have went down many wrong roads on my hunt. time and time again,  frequently shunned. through valleys and hills, with heart my guide and myself as the fleet, i have sailed many tempestuous seas. i have made people cry. and i have made people seethe. still i hear the roll of the drum. thundering is the beat of my heart. from the victories i have won. i take the stars as my witness. of the tale i have spun. i will continue to march, the universe be stunned.</p>\n",
				"content_text": "before the rise of the dawn, with the sun yet to greet. i am a drummer marching to my own beat. i am pacing myself on a marathon run. i have went down many wrong roads on my hunt. time and time again,  frequently shunned. through valleys and hills, with heart my guide and myself as the fleet, i have sailed many tempestuous seas. i have made people cry. and i have made people seethe. still i hear the roll of the drum. thundering is the beat of my heart. from the victories i have won. i take the stars as my witness. of the tale i have spun. i will continue to march, the universe be stunned.\n",
				"date_published": "2023-06-09T12:39:27-04:00",
				"url": "https://jze.ng/2023/06/09/before-the-rise.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/05/new-arc.html",
				"title": "new arc",
				"content_html": "<p>i enter the next phase of my life. i&rsquo;m in the dawn of my youth. the sunshine gleams off my brows, into my sight. i&rsquo;m rocking a cradle of dreams. i&rsquo;m swaying with the daisies and chasing the breeze. my heart flutters wild, like leaves on the summer trees. i&rsquo;m living in the nyc suburbs. there is the hint of nature.</p>\n<p>i&rsquo;ve had an encore of laughter and a soliloquy of cries. i tasted the thrill of firsts, my life view is expanding like the broadening skies. i am working towards my <em><strong>prime</strong></em>.</p>\n<p>i&rsquo;ve been thinking a lot about my past. i watched <em>past lives</em>; it wasn&rsquo;t too relatable to me in the romantic aspect, but a central theme in the movie that spoke to me was the message that things don&rsquo;t have to be special. the female lead immigrates from korea to nyc because, &lsquo;koreans don&rsquo;t win the nobel prize in literature.&rsquo; she has big hopes and dreams, leaving behind her best friend (whom she has a crush on). years go by. she goes to a writing retreat and meets a jewish author there. they end up living together to save on rent. she marries him, for a green card. years pass. she is happy in her marriage, but her husband has doubts that he isn&rsquo;t any special.</p>\n<p>when her old best friend comes to nyc from seoul, they reconnect. the movie talks about how the story of childhood friends reconnecting decades later is so special - so unique, and clandestinely serendipitous. there is little drama; she cuts things off and stays with her husband. because even if people aren&rsquo;t a perfect match, love is about everything that comes with being together. people become special to each other.</p>\n<p>in the end, she wasn&rsquo;t a wildly successful author and she and her husband trudge by with a happy life in their modest apartment in brooklyn. she &ldquo;settled&rdquo; in career and love, but is fulfilled and happy. <em>interesting</em>.</p>\n<p>for me, the feeling of being special is tantamount to the peak of what life is about. i want to be unique. i want to be special. when i work, i want what i build to impact the world on a societal basis. i want to make waves, like the entire ocean folding over. and when i love, i want to be the perfect pair, like the sun to the most beautiful tranquil lake. the calmest surface, shimmering to the heat waves. i want to be the best brother i can be, the best son, boyfriend, engineer, whatever other roles i will play. i hate the idea of being replaceable. i don&rsquo;t just dislike it, i loathe the idea that we are <em>destined</em> to be ordinary. <em><strong>normal</strong></em>.</p>\n<p>the thing is, i do think it&rsquo;s true. at work i&rsquo;d be a nothing more than a tool. i haven&rsquo;t always been the best son, and i definitely could have been a better brother. relationships end, and people will move on and find other people. people are replaceable. dreams are like clouds falling to earth. and while i believe most things are like this i&rsquo;ve come to realise that there&rsquo;s nothing wrong with that too. it&rsquo;s still special.</p>\n<p>even with that, i refuse to accept my fate. i want my life, my love, my work to last to time immemorial. i will always be a first-rate version of myself, instead of a second-rate version of somebody else. and it&rsquo;s hard. really hard. comparison is the thief of joy and it is always there. i used to always want to fit in, but sometime over my life, i realised fitting in was standing out. i want to be <em><strong>special</strong></em>. i hope i can be. or will i just be <em>another</em> asian tech guy?</p>\n<p>so that&rsquo;s why i didn&rsquo;t love <em>past lives</em> too much. i don&rsquo;t like settling. i will achieve my happiness in the exact way i want it, all the time. i really hate being beholden to other people&rsquo;s standards and traditions and expectations. on the other hand, i watched the new spiderverse movie and that was amazing. everything was amazing about it, but especially the idea that we should fight for our own future the way we want it. we are only special if we work for it. i vibe with that.</p>\n<p>my goals going forward have shifted. before i was trying to make it in this world. now i am determined. i have things and people in my future that important to me. here is a changelog/schedule of different things:</p>\n<ul>\n<li>no more rock climbing because the commute is too long, but i will probably do it in the future</li>\n<li>moved to bayside, leeching off my parents for free rent</li>\n<li>1 hr of chess study a day, goal is 2,000 (online, not otb)</li>\n<li>2 hrs of codeforces a day, goal is 2,500 (and related sites)</li>\n<li>consistent 8 hour work days for <em><strong>batch</strong></em></li>\n<li>consistent 7 hours of sleep</li>\n<li>workout daily (need to find a gym, optionally learn swimming)</li>\n<li>unlimited time for girlfriend, but that&rsquo;s the same</li>\n<li>rest of time spent on stuff like getting a license, cooking, house hunting, writing, thinking</li>\n<li>buying a house&hellip; :D</li>\n<li>no boba for a long while&hellip;</li>\n<li>recently i&rsquo;ve been more emotional lately, but i&rsquo;ve decided reign that in. trying to limit to only happy thoughts. i realize i am my own worst enemy most of the time</li>\n<li>probably going to start using twitter, for networking</li>\n<li>i&rsquo;m just gonna become extroverted</li>\n<li>still not the right time to make local friends, one of these days, wcyd</li>\n</ul>\n<p>this phase will probably last until i acquire said house. then, we&rsquo;ll change a few things. i&rsquo;m gearing up for my prime. in most things, you can reach the 99th percentile just through hard work, but i want to find the thing i&rsquo;m destined for—best in world. i want to be a <strong>dragon</strong>. i&rsquo;m learning to <em>fly</em>. i want to spread my arms out and soar down the mountainside, feeling the wind under my wings.</p>\n<img src=\"https://cdn.uploads.micro.blog/101100/2023/ad639fc522.jpg\" width=\"600\" height=\"377\" alt=\"\" />\n",
				"content_text": "i enter the next phase of my life. i'm in the dawn of my youth. the sunshine gleams off my brows, into my sight. i'm rocking a cradle of dreams. i'm swaying with the daisies and chasing the breeze. my heart flutters wild, like leaves on the summer trees. i'm living in the nyc suburbs. there is the hint of nature. \n\ni've had an encore of laughter and a soliloquy of cries. i tasted the thrill of firsts, my life view is expanding like the broadening skies. i am working towards my ***prime***. \n\ni've been thinking a lot about my past. i watched *past lives*; it wasn't too relatable to me in the romantic aspect, but a central theme in the movie that spoke to me was the message that things don't have to be special. the female lead immigrates from korea to nyc because, 'koreans don't win the nobel prize in literature.' she has big hopes and dreams, leaving behind her best friend (whom she has a crush on). years go by. she goes to a writing retreat and meets a jewish author there. they end up living together to save on rent. she marries him, for a green card. years pass. she is happy in her marriage, but her husband has doubts that he isn't any special. \n\nwhen her old best friend comes to nyc from seoul, they reconnect. the movie talks about how the story of childhood friends reconnecting decades later is so special - so unique, and clandestinely serendipitous. there is little drama; she cuts things off and stays with her husband. because even if people aren't a perfect match, love is about everything that comes with being together. people become special to each other. \n\nin the end, she wasn't a wildly successful author and she and her husband trudge by with a happy life in their modest apartment in brooklyn. she \"settled\" in career and love, but is fulfilled and happy. *interesting*. \n\nfor me, the feeling of being special is tantamount to the peak of what life is about. i want to be unique. i want to be special. when i work, i want what i build to impact the world on a societal basis. i want to make waves, like the entire ocean folding over. and when i love, i want to be the perfect pair, like the sun to the most beautiful tranquil lake. the calmest surface, shimmering to the heat waves. i want to be the best brother i can be, the best son, boyfriend, engineer, whatever other roles i will play. i hate the idea of being replaceable. i don't just dislike it, i loathe the idea that we are *destined* to be ordinary. ***normal***.\n\nthe thing is, i do think it's true. at work i'd be a nothing more than a tool. i haven't always been the best son, and i definitely could have been a better brother. relationships end, and people will move on and find other people. people are replaceable. dreams are like clouds falling to earth. and while i believe most things are like this i've come to realise that there's nothing wrong with that too. it's still special.\n\neven with that, i refuse to accept my fate. i want my life, my love, my work to last to time immemorial. i will always be a first-rate version of myself, instead of a second-rate version of somebody else. and it's hard. really hard. comparison is the thief of joy and it is always there. i used to always want to fit in, but sometime over my life, i realised fitting in was standing out. i want to be ***special***. i hope i can be. or will i just be *another* asian tech guy?\n\nso that's why i didn't love *past lives* too much. i don't like settling. i will achieve my happiness in the exact way i want it, all the time. i really hate being beholden to other people's standards and traditions and expectations. on the other hand, i watched the new spiderverse movie and that was amazing. everything was amazing about it, but especially the idea that we should fight for our own future the way we want it. we are only special if we work for it. i vibe with that.\n\nmy goals going forward have shifted. before i was trying to make it in this world. now i am determined. i have things and people in my future that important to me. here is a changelog/schedule of different things:\n\n* no more rock climbing because the commute is too long, but i will probably do it in the future\n* moved to bayside, leeching off my parents for free rent\n* 1 hr of chess study a day, goal is 2,000 (online, not otb)\n* 2 hrs of codeforces a day, goal is 2,500 (and related sites)\n* consistent 8 hour work days for ***batch***\n* consistent 7 hours of sleep\n* workout daily (need to find a gym, optionally learn swimming)\n* unlimited time for girlfriend, but that's the same\n* rest of time spent on stuff like getting a license, cooking, house hunting, writing, thinking\n* buying a house... :D\n* no boba for a long while...\n* recently i've been more emotional lately, but i've decided reign that in. trying to limit to only happy thoughts. i realize i am my own worst enemy most of the time\n* probably going to start using twitter, for networking\n* i'm just gonna become extroverted\n* still not the right time to make local friends, one of these days, wcyd\n\nthis phase will probably last until i acquire said house. then, we'll change a few things. i'm gearing up for my prime. in most things, you can reach the 99th percentile just through hard work, but i want to find the thing i'm destined for—best in world. i want to be a **dragon**. i'm learning to _fly_. i want to spread my arms out and soar down the mountainside, feeling the wind under my wings.\n\n<img src=\"https://cdn.uploads.micro.blog/101100/2023/ad639fc522.jpg\" width=\"600\" height=\"377\" alt=\"\" />\n",
				"date_published": "2023-06-05T18:31:05-04:00",
				"url": "https://jze.ng/2023/06/05/new-arc.html",
				"tags": ["life update","thought","essay","rant"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/06/05/life-isnt-beautiful.html",
				
				"content_html": "<h2 id=\"belief\">belief</h2>\n<p>life isn&rsquo;t beautiful <br>\ni refuse to believe,  <br>\nwe all have a place on this earth<br>\ni know<br>\nthat dreams are destined to die and<br>\nthat hope is worthless<br>\ni refuse to <em><strong>believe</strong></em></p>\n<p>(read lines bottom up afterwards)</p>\n",
				"content_text": "belief\n---------------\nlife isn't beautiful    \ni refuse to believe,     \nwe all have a place on this earth   \ni know   \nthat dreams are destined to die and   \nthat hope is worthless  \ni refuse to ***believe***    \n\n(read lines bottom up afterwards)\n",
				"date_published": "2023-06-05T17:11:05-04:00",
				"url": "https://jze.ng/2023/06/05/life-isnt-beautiful.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/30/im-okay-now.html",
				
				"content_html": "<h2 id=\"death\">death</h2>\n<p>i&rsquo;m&hellip; i&rsquo;m okay now, this is just a part of life; our favorite song is playing in the background. <br>\ni hear the words, &ldquo;you are imperfect, permanently and inevitably flawed. and you are beautiful.” <br>\n&ldquo;do you even love me?&rdquo; i whisper, in tears.  <br>\nmy battery is at one percent. just maybe. i dial her number.  <br>\nnothing happens. <br>\ni pull the trigger.</p>\n<p>(now read lines backwards)</p>\n",
				"content_text": "death\n---------------\ni'm... i'm okay now, this is just a part of life; our favorite song is playing in the background.    \ni hear the words, \"you are imperfect, permanently and inevitably flawed. and you are beautiful.”    \n\"do you even love me?\" i whisper, in tears.     \nmy battery is at one percent. just maybe. i dial her number.     \nnothing happens.    \ni pull the trigger.      \n\n(now read lines backwards)\n",
				"date_published": "2023-05-30T17:55:58-04:00",
				"url": "https://jze.ng/2023/05/30/im-okay-now.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/30/random-thought-about.html",
				
				"content_html": "<p>random thought about learning:</p>\n<p>&ldquo;gifted&rdquo; kids are placed in accelerated programs as early as elementary. in middle school they will continue to be gifted because they learned more relative to their peers. same in high school. same in college. some people are lucky; some people just need an honest chance.</p>\n",
				"content_text": "random thought about learning:\r\n\r\n\"gifted\" kids are placed in accelerated programs as early as elementary. in middle school they will continue to be gifted because they learned more relative to their peers. same in high school. same in college. some people are lucky; some people just need an honest chance.\n",
				"date_published": "2023-05-30T17:18:46-04:00",
				"url": "https://jze.ng/2023/05/30/random-thought-about.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/30/a-heavy-truth.html",
				
				"content_html": "<p>a heavy truth <br>\ndestined to lose <br>\nmade to feel hopeless<br>\ntold to hope less<br>\ndrunk on a feeling<br>\nwith the stars in the sky</p>\n",
				"content_text": "a heavy truth    \ndestined to lose    \nmade to feel hopeless  \ntold to hope less   \ndrunk on a feeling   \nwith the stars in the sky   \n",
				"date_published": "2023-05-30T17:14:15-04:00",
				"url": "https://jze.ng/2023/05/30/a-heavy-truth.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/30/jiggly-cupcake.html",
				
				"content_html": "<p>jiggly is good</p>\n<p class=\"codepen\" data-height=\"300\" data-theme-id=\"45423\" data-default-tab=\"result\" data-slug-hash=\"RwemmXx\" data-user=\"mapsdkhsd\" data-token=\"127021929d667577baeece1d29cfeb12\" style=\"height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\">\n  jiggly cupcake\n</p>\n<script async src=\"https://cpwebassets.codepen.io/assets/embed/ei.js\"></script>\nlol the mouth is weird on mobile, idk\n",
				"content_text": "jiggly is good\n\n<p class=\"codepen\" data-height=\"300\" data-theme-id=\"45423\" data-default-tab=\"result\" data-slug-hash=\"RwemmXx\" data-user=\"mapsdkhsd\" data-token=\"127021929d667577baeece1d29cfeb12\" style=\"height: 300px; box-sizing: border-box; display: flex; align-items: center; justify-content: center; border: 2px solid; margin: 1em 0; padding: 1em;\">\n  jiggly cupcake\n</p>\n<script async src=\"https://cpwebassets.codepen.io/assets/embed/ei.js\"></script>\nlol the mouth is weird on mobile, idk\n",
				"date_published": "2023-05-30T16:28:54-04:00",
				"url": "https://jze.ng/2023/05/30/jiggly-cupcake.html",
				"tags": ["code"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/28/public-markets-are.html",
				
				"content_html": "<p>public markets are effectively for dumb money because they&rsquo;re essentially set up to take advantage of investors. unless u wanna abuse those losers.</p>\n",
				"content_text": "public markets are effectively for dumb money because they're essentially set up to take advantage of investors. unless u wanna abuse those losers.\n",
				"date_published": "2023-05-28T21:46:55-04:00",
				"url": "https://jze.ng/2023/05/28/public-markets-are.html",
				"tags": ["thought"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/28/214457.html",
				
				"content_html": "<p><a href=\"https://www.psychologytoday.com/us/blog/magnetic-partners/202305/the-never-married-a-new-normal\">www.psychologytoday.com/us/blog/m&hellip;</a></p>\n<p>👀</p>\n",
				"content_text": "[www.psychologytoday.com/us/blog/m...](https://www.psychologytoday.com/us/blog/magnetic-partners/202305/the-never-married-a-new-normal)\n\n👀\n",
				"date_published": "2023-05-28T21:44:57-04:00",
				"url": "https://jze.ng/2023/05/28/214457.html",
				"tags": ["thought"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/28/someday-when-the.html",
				
				"content_html": "<p>someday when the future meets the past<br>\nwhen your hope is dangling by a string<br>\ni’ll share in your suffering<br>\njust give me reasons to believe<br>\nthat you would do the same for me</p>\n",
				"content_text": "someday when the future meets the past  \nwhen your hope is dangling by a string  \ni’ll share in your suffering  \njust give me reasons to believe  \nthat you would do the same for me  \n",
				"date_published": "2023-05-28T20:49:18-04:00",
				"url": "https://jze.ng/2023/05/28/someday-when-the.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/28/and-when-the.html",
				
				"content_html": "<p>and when the sun starts setting<br>\nthe world goes cold<br>\nnight is falling <br>\nsee the stars alight at night<br>\nconstellations in the sky<br>\nlike the distance between your eyes<br>\nthe universe in your pupils leads the way<br>\nthe moon is glowing<br>\ni’ll make starlight circle the room</p>\n",
				"content_text": "and when the sun starts setting  \nthe world goes cold  \nnight is falling    \nsee the stars alight at night  \nconstellations in the sky  \nlike the distance between your eyes   \nthe universe in your pupils leads the way  \nthe moon is glowing  \ni’ll make starlight circle the room\n",
				"date_published": "2023-05-28T20:43:00-04:00",
				"url": "https://jze.ng/2023/05/28/and-when-the.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/28/some-thoughts-of.html",
				
				"content_html": "<p>thoughts on doing hard stuff:</p>\n<p>it’s funny cause i get different advice depending on who i ask. some people <em>always</em> tell me not to burn out because they’ve seen other people burn out. “there’s never a limit where you can stop grinding, so it’s not worth it to chase highs.” and when i ask others, they tell me, “if you’re struggling with x, read y, just do z, you got this.”</p>\n<p>it’s like they don’t even consider failure. those are the people that even fall upwards. im jealous.</p>\n",
				"content_text": "thoughts on doing hard stuff:\n\nit’s funny cause i get different advice depending on who i ask. some people *always* tell me not to burn out because they’ve seen other people burn out. “there’s never a limit where you can stop grinding, so it’s not worth it to chase highs.” and when i ask others, they tell me, “if you’re struggling with x, read y, just do z, you got this.” \n\nit’s like they don’t even consider failure. those are the people that even fall upwards. im jealous. \n",
				"date_published": "2023-05-28T20:30:20-04:00",
				"url": "https://jze.ng/2023/05/28/some-thoughts-of.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/28/i-make-it.html",
				
				"content_html": "<p>i make it work. like magic. people always doubt <em>everything</em>. what they don’t know? im just a loser that puts in so much damn effort. i can conjure anything.</p>\n",
				"content_text": "i make it work. like magic. people always doubt *everything*. what they don’t know? im just a loser that puts in so much damn effort. i can conjure anything.\n",
				"date_published": "2023-05-28T20:25:37-04:00",
				"url": "https://jze.ng/2023/05/28/i-make-it.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/25/az-getting-roasted.html",
				
				"content_html": "<p>a16z getting roasted</p>\n<p><a href=\"https://news.ycombinator.com/item?id=36072268\">news.ycombinator.com/;)</a></p>\n<p>brings me much joy</p>\n",
				"content_text": "a16z getting roasted\n\n[news.ycombinator.com/;)](https://news.ycombinator.com/item?id=36072268)\n\nbrings me much joy\n",
				"date_published": "2023-05-25T15:50:22-04:00",
				"url": "https://jze.ng/2023/05/25/az-getting-roasted.html",
				"tags": ["rant"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/25/sleep.html",
				"title": "sleep",
				"content_html": "<p>thoughts stir in the night,<br>\nshadowing the moon&rsquo;s soft light, <br>\nsleep&rsquo;s elusive flight.</p>\n<hr>\n<p>Lying in bed, you gaze at the ceiling, swaddled in the dark quiet of your room. It&rsquo;s late, the world outside is sleeping, but you&hellip; you are awake. The day has faded away, the bustling sounds of life have quieted, the light has been replaced by the soft glow of the moon. And yet, despite the tranquil vibe, your mind refuses to cooperate. It buzzes, hums, races - it remains immersed in a sea of thoughts that you simply can&rsquo;t silence - it leaves you to drown.</p>\n<p>The perpetual storm seems to crescendo during the night when distractions wane, and you&rsquo;re left alone with your mind. Ideas, worries, plans, regrets, fantasies, memories, all whirl in a ceaseless torrent, a kaleidoscope of thoughts that keep you pinned to the present, unable to drift into your dreams.</p>\n<p>Each night, you find yourself wrestling with existential inquiries or obsessing over minor details from the day&rsquo;s happenings. Your mind gets ensnared in hypothetical scenarios or rehearses events that have no certainty of occurring. At times, it&rsquo;s as though your consciousness is a stage and each thought a relentless actor, delivering monologues long into the night, refusing to exit and allow for any intermission.</p>\n<p>Anxiety and worries become magnified in the quiet of the night, their weight growing heavier with each passing hour. The pressures of the past and the uncertainties of the future vie for attention, the abstract fears seamlessly intertwining with mundane worries.</p>\n<p>This is the paradox of your restless mind. At the precise time when you should be winding down, letting go of the day&rsquo;s worries, your thoughts become louder, more insistent. They tug at you, each demanding attention, and keep you from the rest you need. I just want to go to sleep.</p>",
				"content_text": "thoughts stir in the night,   \nshadowing the moon's soft light,    \nsleep's elusive flight.     \n\n<!--more-->\n---------------\n\nLying in bed, you gaze at the ceiling, swaddled in the dark quiet of your room. It's late, the world outside is sleeping, but you... you are awake. The day has faded away, the bustling sounds of life have quieted, the light has been replaced by the soft glow of the moon. And yet, despite the tranquil vibe, your mind refuses to cooperate. It buzzes, hums, races - it remains immersed in a sea of thoughts that you simply can't silence - it leaves you to drown.\n\nThe perpetual storm seems to crescendo during the night when distractions wane, and you're left alone with your mind. Ideas, worries, plans, regrets, fantasies, memories, all whirl in a ceaseless torrent, a kaleidoscope of thoughts that keep you pinned to the present, unable to drift into your dreams.\n\nEach night, you find yourself wrestling with existential inquiries or obsessing over minor details from the day's happenings. Your mind gets ensnared in hypothetical scenarios or rehearses events that have no certainty of occurring. At times, it's as though your consciousness is a stage and each thought a relentless actor, delivering monologues long into the night, refusing to exit and allow for any intermission.\n\nAnxiety and worries become magnified in the quiet of the night, their weight growing heavier with each passing hour. The pressures of the past and the uncertainties of the future vie for attention, the abstract fears seamlessly intertwining with mundane worries.\n\nThis is the paradox of your restless mind. At the precise time when you should be winding down, letting go of the day's worries, your thoughts become louder, more insistent. They tug at you, each demanding attention, and keep you from the rest you need. I just want to go to sleep.\n",
				"date_published": "2023-05-25T13:52:34-04:00",
				"url": "https://jze.ng/2023/05/25/sleep.html",
				"tags": ["poetry","thought","essay"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/25/names.html",
				"title": "names",
				"content_html": "<p>Among the multitude of names, is mine, echoing through the corridors of time. Will it make a resounding sound, etching itself indelibly into the collective consciousness, or will it die in a whimper?</p>\n<p>&ldquo;Johnny,&rdquo; - a name carrying the weight of historical religious reverence. “God is gracious,” they say. Repeated in lullabies and anthems, whispered in classrooms and shouted in arenas, it transcends. For some it’s a nickname, but that’s my name. For me, it’s never about what they call me, but what I answer to. Call me and I will part the sea for you.</p>\n<p>Then, &ldquo;Zeng,&rdquo; a name tethered to deep roots in eastern heritage. It hints at a lineage dating back to the ancient kings of the Xia Dynasty, who did something amazing and probably quite refined, I’m sure. A tethered line, an unbroken chain—of royalty.</p>\n<blockquote>\n<p>“What&rsquo;s in a name? <br>\nThat which we call a rose <br>\nby any other name would smell as sweet.”</p>\n<p>― <cite>some dead bard</cite></p>\n</blockquote>\n<p>Names are for products—ways to remember things easier by or to provide classification. Like the selection of a restaurant menu are the <em>names</em>, but the food items taste delectably different at each location. Names are for people to pattern match on. I wish to be no such structure.</p>\n<p>Like tradition, I can’t fathom why some things must be so unchanging. Not a single Chinese person has ever cared what their ridiculous last name has ever implied. The years of imperialism are over. Your family name means less than the dirt you tread on. I wish I could choose what I stand for, instead of being bound by the dead remembrance of a pathetic ruler. Times change.</p>\n<p>Google was originally <em>Backrub</em>. Enough said.</p>\n<hr>\n<p>Until you get married because then being bound by name is very much more symbolic, beautiful, and meaningful.</p>",
				"content_text": "Among the multitude of names, is mine, echoing through the corridors of time. Will it make a resounding sound, etching itself indelibly into the collective consciousness, or will it die in a whimper?\n\n<!--more-->\n\n\"Johnny,\" - a name carrying the weight of historical religious reverence. “God is gracious,” they say. Repeated in lullabies and anthems, whispered in classrooms and shouted in arenas, it transcends. For some it’s a nickname, but that’s my name. For me, it’s never about what they call me, but what I answer to. Call me and I will part the sea for you.\n\nThen, \"Zeng,\" a name tethered to deep roots in eastern heritage. It hints at a lineage dating back to the ancient kings of the Xia Dynasty, who did something amazing and probably quite refined, I’m sure. A tethered line, an unbroken chain—of royalty.\n\n> “What's in a name?    \n> That which we call a rose    \n> by any other name would smell as sweet.”\n>\n> ― <cite>some dead bard</cite>\n\nNames are for products—ways to remember things easier by or to provide classification. Like the selection of a restaurant menu are the _names_, but the food items taste delectably different at each location. Names are for people to pattern match on. I wish to be no such structure.\n\nLike tradition, I can’t fathom why some things must be so unchanging. Not a single Chinese person has ever cared what their ridiculous last name has ever implied. The years of imperialism are over. Your family name means less than the dirt you tread on. I wish I could choose what I stand for, instead of being bound by the dead remembrance of a pathetic ruler. Times change.\n\nGoogle was originally _Backrub_. Enough said.\n\n--------------\n\nUntil you get married because then being bound by name is very much more symbolic, beautiful, and meaningful.\n",
				"date_published": "2023-05-25T13:24:38-04:00",
				"url": "https://jze.ng/2023/05/25/names.html",
				"tags": ["thought","essay","rant"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/25/revolutionary-is-our.html",
				
				"content_html": "<blockquote>\n<p>“Revolutionary is our baseline. Different is our first step. And radical means we’re just getting started.”</p>\n<p>― <cite>nclud</cite></p>\n</blockquote>\n",
				"content_text": "> “Revolutionary is our baseline. Different is our first step. And radical means we’re just getting started.”\r\n>\r\n> ― <cite>nclud</cite>\n",
				"date_published": "2023-05-25T06:16:09-04:00",
				"url": "https://jze.ng/2023/05/25/revolutionary-is-our.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/25/its-midnight-spicy.html",
				"title": "spicy rigatoni",
				"content_html": "<p>it’s midnight <br>\nspicy rigatoni</p>\n<p>the onion              <br>\ncries silent tears              <br>\ngarlic sings              <br>\na pungent love song              <br>\nfills the ears              <br>\nthe tomatoes              <br>\nadd a blush of dawn               <br>\nin the heated fray              <br>\nas i               <br>\ngently stir all your worries away              <br>\na drizzle of olive oil              <br>\na taste of the vine              <br>\na secret ingredient              <br>\naged through time               <br>\n(just vodka, although not yet)              <br>\na pinch of salt              <br>\na dash of spice              <br>\nadded with care              <br>\nmeasured precise              <br>\nsoon, a shared glance               <br>\nover a shared meal              <br>\nin simple words              <br>\nin simple flavors              <br>\na sizzle and pop              <br>\na bubbling brew                         <br>\nevery flavor whispers              <br>\n&lsquo;i love you&rsquo;</p>",
				"content_text": "it’s midnight    \nspicy rigatoni      \n\n<!--more-->\n\nthe onion                 \ncries silent tears                 \ngarlic sings                 \na pungent love song                 \nfills the ears                 \nthe tomatoes                 \nadd a blush of dawn                  \nin the heated fray                 \nas i                  \ngently stir all your worries away                 \na drizzle of olive oil                 \na taste of the vine                 \na secret ingredient                 \naged through time                  \n(just vodka, although not yet)                 \na pinch of salt                 \na dash of spice                 \nadded with care                 \nmeasured precise                 \nsoon, a shared glance                  \nover a shared meal                 \nin simple words                 \nin simple flavors                 \na sizzle and pop                 \na bubbling brew                            \nevery flavor whispers                 \n'i love you'                 \n\n\n",
				"date_published": "2023-05-25T05:57:39-04:00",
				"url": "https://jze.ng/2023/05/25/its-midnight-spicy.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/25/first-principles-rant.html",
				"title": "first principles (rant)",
				"content_html": "<p>[redacted because it&rsquo;s 5am and i was bored and there was too much passive aggressive ranting]</p>\n<p>tl;dr0 i liiike first principle thinking</p>\n<p>tl;dr something abt the us curriculum and how to educate kids</p>\n<p>tl;dr2 if you took any concept in the world today and judged it based on it&rsquo;s merit rather than traditional or cultural presence, you&rsquo;d likely find a significant difference. the world is broken, really, isn&rsquo;t it? i hate tradition, i really do. i&rsquo;ll go out of my way to do everything the way i want to.</p>\n<p>tl;dr3 nvm, cause if everyone thought like me, they&rsquo;d be as stupid as i am. the world be doomed. it&rsquo;d end in like a week.</p>",
				"content_text": "[redacted because it's 5am and i was bored and there was too much passive aggressive ranting] \n<!--more-->\ntl;dr0 i liiike first principle thinking\n\ntl;dr something abt the us curriculum and how to educate kids\n\ntl;dr2 if you took any concept in the world today and judged it based on it's merit rather than traditional or cultural presence, you'd likely find a significant difference. the world is broken, really, isn't it? i hate tradition, i really do. i'll go out of my way to do everything the way i want to. \n\ntl;dr3 nvm, cause if everyone thought like me, they'd be as stupid as i am. the world be doomed. it'd end in like a week.\n",
				"date_published": "2023-05-25T05:42:27-04:00",
				"url": "https://jze.ng/2023/05/25/first-principles-rant.html",
				"tags": ["rant"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/24/openai-outage-outages.html",
				
				"content_html": "<p><a href=\"https://status.openai.com/history\">openai outage</a></p>\n<p>outages are funny, aren&rsquo;t they. i&rsquo;ve built a total of 2 status pages throughout my life. they are very easy to do&hellip; a couple of integrations and you&rsquo;re done. except, people, all these companies, use atlassian <a href=\"https://www.atlassian.com/software/statuspage\">statuspage</a>. weirdos.</p>\n<p>especially because status pages are mostly for high-level facing users, while more advanced incident reporting tools are critical. why pay like $20k/yr for it. beats me. sounds like atlassian needs basic competition.</p>\n",
				"content_text": "[openai outage](https://status.openai.com/history)\n\noutages are funny, aren't they. i've built a total of 2 status pages throughout my life. they are very easy to do... a couple of integrations and you're done. except, people, all these companies, use atlassian [statuspage](https://www.atlassian.com/software/statuspage). weirdos. \n\nespecially because status pages are mostly for high-level facing users, while more advanced incident reporting tools are critical. why pay like $20k/yr for it. beats me. sounds like atlassian needs basic competition.\n",
				"date_published": "2023-05-24T17:01:37-04:00",
				"url": "https://jze.ng/2023/05/24/openai-outage-outages.html",
				"tags": ["thought","tech"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/21/i-hope-our.html",
				
				"content_html": "<p>i hope our love grows wings<br>\nlike butterflies<br>\nand flutters to the moon</p>\n",
				"content_text": "i hope our love grows wings   \nlike butterflies   \nand flutters to the moon\n",
				"date_published": "2023-05-21T14:05:39-04:00",
				"url": "https://jze.ng/2023/05/21/i-hope-our.html",
				"tags": ["poetry","quotes"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/21/love-has-made.html",
				
				"content_html": "<p>love has made my soul crawl out of its hiding place</p>\n",
				"content_text": "love has made my soul crawl out of its hiding place\n",
				"date_published": "2023-05-21T12:51:29-04:00",
				"url": "https://jze.ng/2023/05/21/love-has-made.html",
				"tags": ["quotes"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/21/the-gravity-of.html",
				"title": "the gravity of my love",
				"content_html": "<p>i never seem to be able to properly convey the extent of my love</p>\n<p><a href=\"https://jze.ng/uploads/2023/ece677d16d.html\">a little embarassing</a></p>",
				"content_text": "i never seem to be able to properly convey the extent of my love\n<!--more-->                \n\n[a little embarassing](https://jze.ng/uploads/2023/ece677d16d.html)\n",
				"date_published": "2023-05-21T04:20:08-04:00",
				"url": "https://jze.ng/2023/05/21/the-gravity-of.html",
				"tags": ["poetry","private"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/20/there-is-an.html",
				
				"content_html": "<p>there is an old saying that jesus’s greatest miracle wasn’t turning water into wine or raising the dead. it was being a 30-year-old with 12 close friends.</p>\n<p>friendship became a casualty of growing up.</p>\n",
				"content_text": "there is an old saying that jesus’s greatest miracle wasn’t turning water into wine or raising the dead. it was being a 30-year-old with 12 close friends.\n\nfriendship became a casualty of growing up.\n",
				"date_published": "2023-05-20T17:52:57-04:00",
				"url": "https://jze.ng/2023/05/20/there-is-an.html",
				"tags": ["quotes"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/20/side-projects.html",
				"title": "side projects",
				"content_html": "<p>people suck at choosing side projects for cs for whatever reason (personal, for job apps, for college apps, etc.). here are my thoughts on that.</p>\n<p>first there are learning projects and then there are practical projects. the former is stuff like classwork, basic stuff like rubicks cube simulator, or otherwise fodder projects. don&rsquo;t do these. if you really want to do these, i&rsquo;d recommend doing stuff like research or open source software contributions.</p>\n<p>instead, choose to make stuff that actually is practical. one good way to measure this is to guess how popular your project will be.</p>\n<p>one tip is to pick a niche and make something for it. for example, if you created a pokemon showdown ai, then you&rsquo;d likely get a lot of traction and interest from the community. also the competition is weaker, where basically the best ai atm is <a href=\"https://www.youtube.com/watch?v=rhvj7CmTRkg\">this kid&rsquo;s bot</a>. i&rsquo;m sure you could do a better job. you&rsquo;d get a lot more traction, usage, and metrics to show off. i would say this would be a great side project.</p>\n<p>another example. this guy made a <a href=\"https://duiqt.github.io/herta_kuru/\">honkai: star rail herta fan website</a> and it is completely memey, simple, but fun. but it still has 80 stars on github and it reaches people on <a href=\"https://www.reddit.com/r/HonkaiStarRail/comments/13mag83/for_all_my_kuru_kuru_fans_here_is_a_website_where/\">reddit</a> and <a href=\"https://twitter.com/Seseren_kr\">twitter</a>. more reach. and your project has value. in this example, people are used to fan-art, but not silly sites, which makes it perfect.</p>\n<p>on a side note i found <a href=\"https://www.youtube.com/watch?v=9-olgZch8sg\">this youtuber&rsquo;s project</a> and his crappy startup, <a href=\"https://www.ratemydorm.com/\">ratemydorm</a>. see, again, it&rsquo;s a good project and has lots of traction 👍. just don&rsquo;t ever think a dorm rating project has any traction as a venture-funded startup&hellip; it was good for youtube views, but not much else.</p>\n<p>idk thats about it&hellip; i should write more on this later because 93% of side projects seem like regurgitated garbage.</p>",
				"content_text": "people suck at choosing side projects for cs for whatever reason (personal, for job apps, for college apps, etc.). here are my thoughts on that.\r\n\r\n<!--more-->\r\n\r\nfirst there are learning projects and then there are practical projects. the former is stuff like classwork, basic stuff like rubicks cube simulator, or otherwise fodder projects. don't do these. if you really want to do these, i'd recommend doing stuff like research or open source software contributions.\r\n\r\ninstead, choose to make stuff that actually is practical. one good way to measure this is to guess how popular your project will be. \r\n\r\none tip is to pick a niche and make something for it. for example, if you created a pokemon showdown ai, then you'd likely get a lot of traction and interest from the community. also the competition is weaker, where basically the best ai atm is [this kid's bot](https://www.youtube.com/watch?v=rhvj7CmTRkg). i'm sure you could do a better job. you'd get a lot more traction, usage, and metrics to show off. i would say this would be a great side project.\r\n\r\nanother example. this guy made a [honkai: star rail herta fan website](https://duiqt.github.io/herta_kuru/) and it is completely memey, simple, but fun. but it still has 80 stars on github and it reaches people on [reddit](https://www.reddit.com/r/HonkaiStarRail/comments/13mag83/for_all_my_kuru_kuru_fans_here_is_a_website_where/) and [twitter](https://twitter.com/Seseren_kr). more reach. and your project has value. in this example, people are used to fan-art, but not silly sites, which makes it perfect.\r\n\r\non a side note i found [this youtuber's project](https://www.youtube.com/watch?v=9-olgZch8sg) and his crappy startup, [ratemydorm](https://www.ratemydorm.com/). see, again, it's a good project and has lots of traction 👍. just don't ever think a dorm rating project has any traction as a venture-funded startup... it was good for youtube views, but not much else.\r\n\r\nidk thats about it... i should write more on this later because 93% of side projects seem like regurgitated garbage.\n",
				"date_published": "2023-05-20T13:29:05-04:00",
				"url": "https://jze.ng/2023/05/20/side-projects.html",
				"tags": ["tech"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/20/why-i-like.html",
				"title": "why i like space",
				"content_html": "<p>space is really cool because it&rsquo;s big. like, really, really big. so big, we can&rsquo;t even begin to truly grasp its size. 93 billion light-years in diameter. expanding at 70 kilometers per second per megaparsec. there&rsquo;s so goddamn much to see and discover in our universe to uncover. stars, galaxies, black holes, dark matter, and mysterious things that are waiting out there for us to find them.</p>\n<p>when you look up at the sky, you see light from stars that could be billions of years old. you literally look back in time. it makes you realize just how small your problems can be.</p>\n<p>space exploration is really exciting. we&rsquo;ve been to the moon, and now we&rsquo;re going to mars (kinda) and maybe even so much further one day. these missions aren&rsquo;t just cool adventures like a billionaire&rsquo;s random pastime, they&rsquo;re also a way for us to learn more about the universe. every time we send a spacecraft out there, we get lottsa new information that helps us answer big questions. where did we come from? are we alone in the universe?</p>\n<p>and then there&rsquo;s the idea of living in space. space-themed video games, books, movies. a fantasy that we could lowkey be a real thing in one day.</p>\n<p>but its not just about exploration and big ideas. it&rsquo;s also really important for our everyday lives. without satellites, we wouldn&rsquo;t have things like GPS, weather forecasts, or television, and a bunch of other things (you can google them).</p>\n<p>and of course, space is just beautiful, thereotically and practically. in the real world pictures from space missions or telescopes show us immaculate depictions of nature: colorful nebulae where stars are born, galaxies spinning in the vast emptiness, comets streaking across the sky. even just looking at the night sky from earth is breathtaking (as long as you&rsquo;re not in the city).</p>\n<p>thereotically, we have beautiful equations that could begin to help us understand how exactly our universe works. my favorite is einstein&rsquo;s field equations from general relativity.</p>\n<p>in physics, space is not just an empty space where events happen. instead, it&rsquo;s dynamic and interacts with the matter and energy it contains. this idea is basically captured in general relativity.</p>\n<p>einstein&rsquo;s field equations are a set of ten interrelated differential equations that describe how matter and energy in the universe curve spacetime. the curved spacetime, in turn, tells matter and energy how to move. these equations are typically written something like:</p>\n<p>Gμν = 8πG/c⁴ * Tμν</p>\n<p>here, Gμν is the Einstein tensor, which encodes the curvature of spacetime. Tμν is the energy-momentum tensor, which represents the distribution of matter and energy. the symbols G and c are the gravitational constant and the speed of light, respectively, and π is 3. while technically more complex, just think about how beautifully an equation represents some essential part of the universe.</p>\n<p>when they can be solved, they provide insight into the behavior of gravitational fields, such as those around stars, galaxies, and black holes. cool stuffs.</p>\n<p>one of the most famous solutions to einstein&rsquo;s equations is the schwarzschild solution, which describes spacetime outside a spherical, non-rotating mass like a star or a black hole. the solutions to these equations are at the heart of our understanding of cosmology and the large scale structure of the universe. plus, it&rsquo;s just really cool. i wish i had a lifetime to dedicate in service for this.</p>\n<hr>\n<p>but yes, space is pretty cool. i just want to know what my role in the universe is.</p>\n<p>until an asteroid,  <br>\njohnny</p>\n",
				"content_text": "space is really cool because it's big. like, really, really big. so big, we can't even begin to truly grasp its size. 93 billion light-years in diameter. expanding at 70 kilometers per second per megaparsec. there's so goddamn much to see and discover in our universe to uncover. stars, galaxies, black holes, dark matter, and mysterious things that are waiting out there for us to find them.\n\nwhen you look up at the sky, you see light from stars that could be billions of years old. you literally look back in time. it makes you realize just how small your problems can be.\n\nspace exploration is really exciting. we've been to the moon, and now we're going to mars (kinda) and maybe even so much further one day. these missions aren't just cool adventures like a billionaire's random pastime, they're also a way for us to learn more about the universe. every time we send a spacecraft out there, we get lottsa new information that helps us answer big questions. where did we come from? are we alone in the universe?\n\nand then there's the idea of living in space. space-themed video games, books, movies. a fantasy that we could lowkey be a real thing in one day.\n\nbut its not just about exploration and big ideas. it's also really important for our everyday lives. without satellites, we wouldn't have things like GPS, weather forecasts, or television, and a bunch of other things (you can google them).\n\nand of course, space is just beautiful, thereotically and practically. in the real world pictures from space missions or telescopes show us immaculate depictions of nature: colorful nebulae where stars are born, galaxies spinning in the vast emptiness, comets streaking across the sky. even just looking at the night sky from earth is breathtaking (as long as you're not in the city). \n\nthereotically, we have beautiful equations that could begin to help us understand how exactly our universe works. my favorite is einstein's field equations from general relativity.\n\nin physics, space is not just an empty space where events happen. instead, it's dynamic and interacts with the matter and energy it contains. this idea is basically captured in general relativity.\n\neinstein's field equations are a set of ten interrelated differential equations that describe how matter and energy in the universe curve spacetime. the curved spacetime, in turn, tells matter and energy how to move. these equations are typically written something like:\n\nGμν = 8πG/c⁴ * Tμν\n\nhere, Gμν is the Einstein tensor, which encodes the curvature of spacetime. Tμν is the energy-momentum tensor, which represents the distribution of matter and energy. the symbols G and c are the gravitational constant and the speed of light, respectively, and π is 3. while technically more complex, just think about how beautifully an equation represents some essential part of the universe.\n\nwhen they can be solved, they provide insight into the behavior of gravitational fields, such as those around stars, galaxies, and black holes. cool stuffs.\n\none of the most famous solutions to einstein's equations is the schwarzschild solution, which describes spacetime outside a spherical, non-rotating mass like a star or a black hole. the solutions to these equations are at the heart of our understanding of cosmology and the large scale structure of the universe. plus, it's just really cool. i wish i had a lifetime to dedicate in service for this.\n\n-----------\n\nbut yes, space is pretty cool. i just want to know what my role in the universe is.\n\nuntil an asteroid,     \njohnny\n",
				"date_published": "2023-05-20T08:37:28-04:00",
				"url": "https://jze.ng/2023/05/20/why-i-like.html",
				"tags": ["essay"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/20/one-foot-in.html",
				"title": "one foot in front of the other",
				"content_html": "<p>i was trying to think of a slogan for myself and this would have to be it (for now).</p>\n<p>putting one foot in front of the other embodies the essence of progress, representing a steady and deliberate movement forward, no matter how slow or arduous or depressed the path may be. we are our own pathfinders.</p>\n<p>life, like walking (or running), often requires us to face challenges, obstacles, uphill climbs (plenty of those). yet, lets consciously choose to put one foot in front of the other. to create opportunity out of dirt.</p>\n<p>it represents perserverance. it represents resilience, persistence, and an unwavering commitment to our goals. it is a reminder that even the longest journey starts with a single step: that our journey is made up of many small, determined actions.</p>\n<p>it is a testament to the human spirit&rsquo;s capacity to navigate adversity, to keep moving forward, even when the end of the journey is not in sight. with curiosity as our fuel, we are travelers, making our way in this world.</p>",
				"content_text": "i was trying to think of a slogan for myself and this would have to be it (for now). \n\n<!--more-->\n\nputting one foot in front of the other embodies the essence of progress, representing a steady and deliberate movement forward, no matter how slow or arduous or depressed the path may be. we are our own pathfinders. \n\nlife, like walking (or running), often requires us to face challenges, obstacles, uphill climbs (plenty of those). yet, lets consciously choose to put one foot in front of the other. to create opportunity out of dirt.\n\nit represents perserverance. it represents resilience, persistence, and an unwavering commitment to our goals. it is a reminder that even the longest journey starts with a single step: that our journey is made up of many small, determined actions.\n\nit is a testament to the human spirit's capacity to navigate adversity, to keep moving forward, even when the end of the journey is not in sight. with curiosity as our fuel, we are travelers, making our way in this world.\n",
				"date_published": "2023-05-20T08:17:25-04:00",
				"url": "https://jze.ng/2023/05/20/one-foot-in.html",
				"tags": ["essay"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/20/some-people-are.html",
				
				"content_html": "<p>some people are obstinate like the recurring night   <br>\ntheir thoughts are like winter: frozen and stark   <br>\nclinging to notions; as stubborn as bark  <br>\nspringtime&rsquo;s bloom calls for a tender shift <br>\nfor the minds closed like fists, a gentle lift <br>\nlike sunrise, to change, is a beautiful sight.</p>\n",
				"content_text": "some people are obstinate like the recurring night      \ntheir thoughts are like winter: frozen and stark      \nclinging to notions; as stubborn as bark     \nspringtime's bloom calls for a tender shift    \nfor the minds closed like fists, a gentle lift    \nlike sunrise, to change, is a beautiful sight.     \n",
				"date_published": "2023-05-20T08:01:15-04:00",
				"url": "https://jze.ng/2023/05/20/some-people-are.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/20/meadows-of-laughter.html",
				
				"content_html": "<p>what is friend.</p>\n<p>meadows of laughter, slopes of jest,\nwalks he, immersed in solitude, bored, but no rest,\nin frolicking crowds, amidst jovial delight,\na connection that lacks, a spark without light.\nthere are that smiles that glow, and eyes that shine,\nrealms of warmth; none are mine\nthe words they say, the tales they share,\nto me: a hollow echo, in the vacant air.</p>\n<p>i need an emotional link, a tether unseen,\nbeyond stupid shared interests, or places we&rsquo;ve been.\nan understanding that delves past the skin,\nto the shared human experience, dwelling within.\nso, to the stars, my silent plea,\na friend, a confidant, to help me see,\na painting of life, the colors blend,\nand drawn is the meaning of (friend).</p>\n",
				"content_text": "what is friend.\n\nmeadows of laughter, slopes of jest,\nwalks he, immersed in solitude, bored, but no rest,\nin frolicking crowds, amidst jovial delight,\na connection that lacks, a spark without light.\nthere are that smiles that glow, and eyes that shine,\nrealms of warmth; none are mine\nthe words they say, the tales they share,\nto me: a hollow echo, in the vacant air.\n\ni need an emotional link, a tether unseen,\nbeyond stupid shared interests, or places we've been.\nan understanding that delves past the skin,\nto the shared human experience, dwelling within.\nso, to the stars, my silent plea,\na friend, a confidant, to help me see,\na painting of life, the colors blend,\nand drawn is the meaning of (friend).\n",
				"date_published": "2023-05-20T07:49:36-04:00",
				"url": "https://jze.ng/2023/05/20/meadows-of-laughter.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/20/dragons.html",
				"title": "dragons",
				"content_html": "<p>a while ago, someone showed me their friend&rsquo;s <a href=\"https://blog-sladuca.vercel.app/posts/dragons\">blog post</a> about dragons.</p>\n<p>the idea of dragons are those people that always seem to not just be better than you, but seem to be unreachable—on another plane. i really liked the post and it somewhat deeply resonated with me.</p>\n<p>i have this problem too, but just slightly different. in life, there is a pinnacle in any field. these are the top, undisputed people in the field. we&rsquo;ll use the example of chess: the grandmasters and super grandmasters of chess.</p>\n<p>however, i price my pinnacles at the level which purely effort can take me. this is to delineate a goal for me. the people that i think are the dragons. of course, other people differ. even super-gms defer to magnus carlsen (standing above the competition by 50 elo FIDE rating, whereas 2nd-3rd place is a margin of only 5).</p>\n<p>i&rsquo;ve realized, these pinnacles are still extremely high. so high in fact—that people believe them impossible. and rational actors don&rsquo;t attempt the impossible.  except, many of these things are do-able. very do-able. they just require thousands of hours of work.</p>\n<p>i want to be at the pinnacle at everything i enjoy doing. with the important caveat that it makes sense to pursue it. as long as i tried my absolute hardest, then it was a good effort.</p>\n<hr>\n<p>however, most people also forget they are unique. everyone has their own subset of experiences they experience. you&rsquo;d be surprised at just how rare some things are: how rare you are. the key to becoming a dragon (excluding pure genetic/nurture background types, although that counts as unique too) is to utilise these experiences. make your experiences build on each other.</p>\n<p>i was watching a few startup interviews and what ticked was the surprising position some of these founders were in. a construction worker that learned to code could build a billion dollar business combining the two industries. only when you have that insight at the pinnacle of each field can you see what should be obvious. you can see things other people miss. it&rsquo;s like magic. anyone can perform magic. i truly believe this.</p>\n<hr>\n<p>still, i wanna be a dragon. it&rsquo;s not jealousy. it&rsquo;s just the fact that i&rsquo;m not reaching my full potential. i want to fly. it&rsquo;d be such a waste to have never felt the air under my wings.</p>\n<p>okay, it&rsquo;s jealousy too and some regret. jealousy that other people took up the grind and regret that i gave up too early. the temporary dopamine is nice, but yknow i absolutely live for that delayed gratification.</p>\n<p>see you sometime, <br>\nrushhour</p>",
				"content_text": "a while ago, someone showed me their friend's [blog post](https://blog-sladuca.vercel.app/posts/dragons) about dragons. \n\n<!--more-->\n\nthe idea of dragons are those people that always seem to not just be better than you, but seem to be unreachable—on another plane. i really liked the post and it somewhat deeply resonated with me.\n\ni have this problem too, but just slightly different. in life, there is a pinnacle in any field. these are the top, undisputed people in the field. we'll use the example of chess: the grandmasters and super grandmasters of chess.\n\nhowever, i price my pinnacles at the level which purely effort can take me. this is to delineate a goal for me. the people that i think are the dragons. of course, other people differ. even super-gms defer to magnus carlsen (standing above the competition by 50 elo FIDE rating, whereas 2nd-3rd place is a margin of only 5). \n\ni've realized, these pinnacles are still extremely high. so high in fact—that people believe them impossible. and rational actors don't attempt the impossible.  except, many of these things are do-able. very do-able. they just require thousands of hours of work. \n\ni want to be at the pinnacle at everything i enjoy doing. with the important caveat that it makes sense to pursue it. as long as i tried my absolute hardest, then it was a good effort.\n\n------------------\n\nhowever, most people also forget they are unique. everyone has their own subset of experiences they experience. you'd be surprised at just how rare some things are: how rare you are. the key to becoming a dragon (excluding pure genetic/nurture background types, although that counts as unique too) is to utilise these experiences. make your experiences build on each other. \n\ni was watching a few startup interviews and what ticked was the surprising position some of these founders were in. a construction worker that learned to code could build a billion dollar business combining the two industries. only when you have that insight at the pinnacle of each field can you see what should be obvious. you can see things other people miss. it's like magic. anyone can perform magic. i truly believe this. \n\n-------------------\n\nstill, i wanna be a dragon. it's not jealousy. it's just the fact that i'm not reaching my full potential. i want to fly. it'd be such a waste to have never felt the air under my wings.\n\nokay, it's jealousy too and some regret. jealousy that other people took up the grind and regret that i gave up too early. the temporary dopamine is nice, but yknow i absolutely live for that delayed gratification.\n\nsee you sometime,    \nrushhour\n",
				"date_published": "2023-05-20T07:19:38-04:00",
				"url": "https://jze.ng/2023/05/20/dragons.html",
				"tags": ["thought"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/19/jiggly.html",
				
				"content_html": "<p>jiggly</p>\n<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"yeet\" src=\"https://codepen.io/mapsdkhsd/embed/eYKxpKr/bcaf741a36801e9ac25a6e5912ec742b?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\r\n  bouncy food previews\r\n</iframe>\n",
				"content_text": "jiggly\r\n\r\n<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"yeet\" src=\"https://codepen.io/mapsdkhsd/embed/eYKxpKr/bcaf741a36801e9ac25a6e5912ec742b?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\r\n  bouncy food previews\r\n</iframe>\n",
				"date_published": "2023-05-19T02:35:09-04:00",
				"url": "https://jze.ng/2023/05/19/jiggly.html",
				"tags": ["code"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/19/emergent-gameplayproperties.html",
				"title": "emergent gameplay/properties",
				"content_html": "<p>emergent gameplay is my favorite type of gameplay in video games, by far. it&rsquo;s also one of my favorite things about life in general, but we&rsquo;ll get to that later.</p>\n<p>warning: long-winded and not too organized (and a bit nonsensical), but passionate!</p>\n<p>emergent gameplay (like emergent properties) occurs when simple (or complex) rules work together to create new, unexpected outcomes. i also group things like meta-breaking, easter eggs, and experimental gameplay into here.</p>\n<p>the core enjoyment for me here is multiplayer, with human interactions creating immense emergent options, and i cite Dota 2 and Team Fortress 2 as the best example. Dota 2 of course has a single map, but more than a hundred heroes and hundreds of skills. by quick maths, that&rsquo;s ((123! / (5! (123 - 5)!)) * (118! / (5! (118 - 5)!)))/2 unique 5v5 hero combinations. that&rsquo;s 18 quadrillion drafts. and that&rsquo;s not to mention the same combinations have even more possible ways to play them out. and of course the expansive item shop, and talent system, and map workings. even the user created arcade (and minigames) have immensely fun stuff come out of it (like the entire auto-battling genre, and my personal favorite, overthrow). there are even heroes that can copy the skills of other heroes&hellip; immensely fun. basically infinite combinations. always a new situation.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6GAiMLaYmjo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>for Team Fortress 2, the interactions and wide variety of weapons along with the 16v16 close nature of the game leads to insanely fun mechanics, such as demoknights, a billion ways to spawn camp, rocket jumping, trickstabs, sentry gun locations, duo medics, etc.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/R-78OIlv0Xk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>Noita is another fascinating showcase as well, but is, of course, singleplayer. it just throws in a bunch of elementary spells and equipment and ways to combine and mix them (like a programming language) and you can go all out. usually, it is quite hard to balance these sort of games, and Noita makes no attempt to. don&rsquo;t forget about the falling sand engine it&rsquo;s based off of&hellip; literally pixel by pixel interactions to create an epic emergent simulation.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sdmmf6QFYX8\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>Path of Exile, its passive tree and skill gems, also embody this well. Gradually emergent gameplay is how even the most casual of players fall in love with complexity. small, easy skills. one or two choices. then harder, complex, and more variety. i love these types of games. you can kill galaxy destroying gods with a self-explosion build, or a ring of fire while you afk, or a chain reaction of elements, or min-max with 1 hp, or any other wild combination of things. not to mention the extremely fun and time-consuming crafting system which just completes the game. and leads to loot explosions. i love loot.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/c_WAAILY_eY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>then there&rsquo;s the element of breaking the game—nonlinear gameplay, such as choosing to kill or spare Bleda the Hun in AOE2, fun mechanics like finding ways to kill your sims in Sims or pushing your enemies to death in Swords and Sandals. it is similar to easter eggs, but these are actionable and optionally part of core gameplay. this type of gameplay punches above its weight, and elevates games.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/YxH_ziCiK-c\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<p>then, there&rsquo;s the experimental behavior of games, like Superliminal’s resizing feature. it can be items or mechanics like the Portal Gun. It can be new genres like battle royale and it can be an old genre with a new spin. it can be mods, texture packs, or shaders. it is being experimental only because it is new, but crucially it is no excuse for bad gameplay. this is what players exclaim to their friends about. it just takes a slight spin to create something amazing. minecraft hunger games led to battle royale. a small spin on mafia and twitch popularity led to among us. small, unrelated things can be just the right ingredients for something amazing.</p>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/JJ6vmdfdn5U\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n<hr>\n<p>emergent gameplay is my absolute favorite mechanic, if we can call it that. outside of games, it stands alongside other (albeit simpler) principles i enjoy, like the butterfly effect or the golden rule.</p>\n<p>this is why when companies lose money on end and people clamor for their end, they don&rsquo;t understand the simple brilliance of emergent discoveries in their business models. it&rsquo;s a quantifiable (but hard to quantify) metric. magic is priced-in.</p>\n<p>when web-novel authors introduced pay ahead for chapters, webtoons took that and ran with it. when the gig economy started, people laughed and laughed. and then it blew up. and the sharing economy. and bitcoin and crypto.</p>\n<p>in hindsight people point out that food delivery worked because people had phones now. no, it worked because of a million other reasons. mostly unintentional. they originally paid their own drivers, but then they realized they could just take the tipping culture and take advantage of it. only chinese and pizza places were capable of takeout, and they said restaurants wouldn&rsquo;t sign up. however, restaurants adapted; they were perfectly willing to, but they just didn&rsquo;t even think it was possible. they added on service fees and subscriptions, when originally people would&rsquo;ve been outraged. some of it is natural, some of it is them creating a solution to their own problem, but regardless, it is emergent. and it is brilliant.</p>\n<p>sometimes, you don&rsquo;t worry about whether it will work. you just go and build it. and be ready to pivot, because you could come across the most serendipitous of discoveries.</p>\n<p>HOWEVER.</p>\n<p>while i like games with this sort of emergence and i really find interesting how this type of stuff comes about in real life, i do not particularly abide by this principle myself. it is just too rare to come across, so relying purely on that is foolish.</p>\n<p>in the market you work in hard maths and concrete principles. in chess, the cardinal rule is not to expect your opponent to make any particular move. in love, you cannot just wish for it to work out. in reality, hard work, cleverness, and perseverance can make it work most of the time.</p>\n<p>but those truly brilliant moments come unexpected and often from the arrangement of unrelated, simple things.</p>\n<p>a fun rule of thumb is that say you were given the initial state and asked if the final outcome was even imaginable. if it can be even be dreamed up, then it is not emergent.</p>\n<p>emergent properties are the outcomes that are beyond even our wildest dreams.</p>",
				"content_text": "emergent gameplay is my favorite type of gameplay in video games, by far. it's also one of my favorite things about life in general, but we'll get to that later.\n\n<!--more-->\n\nwarning: long-winded and not too organized (and a bit nonsensical), but passionate!\n\nemergent gameplay (like emergent properties) occurs when simple (or complex) rules work together to create new, unexpected outcomes. i also group things like meta-breaking, easter eggs, and experimental gameplay into here.\n\nthe core enjoyment for me here is multiplayer, with human interactions creating immense emergent options, and i cite Dota 2 and Team Fortress 2 as the best example. Dota 2 of course has a single map, but more than a hundred heroes and hundreds of skills. by quick maths, that's ((123! / (5! (123 - 5)!)) * (118! / (5! (118 - 5)!)))/2 unique 5v5 hero combinations. that's 18 quadrillion drafts. and that's not to mention the same combinations have even more possible ways to play them out. and of course the expansive item shop, and talent system, and map workings. even the user created arcade (and minigames) have immensely fun stuff come out of it (like the entire auto-battling genre, and my personal favorite, overthrow). there are even heroes that can copy the skills of other heroes... immensely fun. basically infinite combinations. always a new situation.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/6GAiMLaYmjo\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\nfor Team Fortress 2, the interactions and wide variety of weapons along with the 16v16 close nature of the game leads to insanely fun mechanics, such as demoknights, a billion ways to spawn camp, rocket jumping, trickstabs, sentry gun locations, duo medics, etc. \n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/R-78OIlv0Xk\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\nNoita is another fascinating showcase as well, but is, of course, singleplayer. it just throws in a bunch of elementary spells and equipment and ways to combine and mix them (like a programming language) and you can go all out. usually, it is quite hard to balance these sort of games, and Noita makes no attempt to. don't forget about the falling sand engine it's based off of... literally pixel by pixel interactions to create an epic emergent simulation.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/sdmmf6QFYX8\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\nPath of Exile, its passive tree and skill gems, also embody this well. Gradually emergent gameplay is how even the most casual of players fall in love with complexity. small, easy skills. one or two choices. then harder, complex, and more variety. i love these types of games. you can kill galaxy destroying gods with a self-explosion build, or a ring of fire while you afk, or a chain reaction of elements, or min-max with 1 hp, or any other wild combination of things. not to mention the extremely fun and time-consuming crafting system which just completes the game. and leads to loot explosions. i love loot.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/c_WAAILY_eY\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\nthen there's the element of breaking the game—nonlinear gameplay, such as choosing to kill or spare Bleda the Hun in AOE2, fun mechanics like finding ways to kill your sims in Sims or pushing your enemies to death in Swords and Sandals. it is similar to easter eggs, but these are actionable and optionally part of core gameplay. this type of gameplay punches above its weight, and elevates games. \n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/YxH_ziCiK-c\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\nthen, there's the experimental behavior of games, like Superliminal’s resizing feature. it can be items or mechanics like the Portal Gun. It can be new genres like battle royale and it can be an old genre with a new spin. it can be mods, texture packs, or shaders. it is being experimental only because it is new, but crucially it is no excuse for bad gameplay. this is what players exclaim to their friends about. it just takes a slight spin to create something amazing. minecraft hunger games led to battle royale. a small spin on mafia and twitch popularity led to among us. small, unrelated things can be just the right ingredients for something amazing.\n\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/JJ6vmdfdn5U\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" allowfullscreen></iframe>\n\n-----------\n\nemergent gameplay is my absolute favorite mechanic, if we can call it that. outside of games, it stands alongside other (albeit simpler) principles i enjoy, like the butterfly effect or the golden rule. \n\nthis is why when companies lose money on end and people clamor for their end, they don't understand the simple brilliance of emergent discoveries in their business models. it's a quantifiable (but hard to quantify) metric. magic is priced-in.\n\nwhen web-novel authors introduced pay ahead for chapters, webtoons took that and ran with it. when the gig economy started, people laughed and laughed. and then it blew up. and the sharing economy. and bitcoin and crypto. \n\nin hindsight people point out that food delivery worked because people had phones now. no, it worked because of a million other reasons. mostly unintentional. they originally paid their own drivers, but then they realized they could just take the tipping culture and take advantage of it. only chinese and pizza places were capable of takeout, and they said restaurants wouldn't sign up. however, restaurants adapted; they were perfectly willing to, but they just didn't even think it was possible. they added on service fees and subscriptions, when originally people would've been outraged. some of it is natural, some of it is them creating a solution to their own problem, but regardless, it is emergent. and it is brilliant.\n\nsometimes, you don't worry about whether it will work. you just go and build it. and be ready to pivot, because you could come across the most serendipitous of discoveries. \n\nHOWEVER.\n\nwhile i like games with this sort of emergence and i really find interesting how this type of stuff comes about in real life, i do not particularly abide by this principle myself. it is just too rare to come across, so relying purely on that is foolish. \n\nin the market you work in hard maths and concrete principles. in chess, the cardinal rule is not to expect your opponent to make any particular move. in love, you cannot just wish for it to work out. in reality, hard work, cleverness, and perseverance can make it work most of the time. \n\nbut those truly brilliant moments come unexpected and often from the arrangement of unrelated, simple things. \n\na fun rule of thumb is that say you were given the initial state and asked if the final outcome was even imaginable. if it can be even be dreamed up, then it is not emergent. \n\nemergent properties are the outcomes that are beyond even our wildest dreams. \n",
				"date_published": "2023-05-19T01:03:04-04:00",
				"url": "https://jze.ng/2023/05/19/emergent-gameplayproperties.html",
				"tags": ["thought"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/18/234034.html",
				
				"content_html": "<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"IMPRESS.JS\" src=\"https://codepen.io/mapsdkhsd/embed/BaPKdmj/12b9b60a82c8a8aa46ee79e9b4fe0427?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\r\n  love - a ppt.\r\n</iframe>\n",
				"content_text": "<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"IMPRESS.JS\" src=\"https://codepen.io/mapsdkhsd/embed/BaPKdmj/12b9b60a82c8a8aa46ee79e9b4fe0427?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\r\n  love - a ppt.\r\n</iframe>\n",
				"date_published": "2023-05-18T23:40:34-04:00",
				"url": "https://jze.ng/2023/05/18/234034.html"
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/18/beware-dizziness.html",
				"title": "spinning thing explanation",
				"content_html": "<p>beware dizziness</p>\n<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"Gate of Time SVG + CSS\" src=\"https://codepen.io/mapsdkhsd/embed/GRYwRBM/682f182c2db4dbd9e14ec35bad2595fc?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\n  spinning thing explanation\n</iframe>\n<p>relatively easy,</p>\n<p>there&rsquo;s an outer main ring and an inside portion. positioning (hard-coded, but not too hard to make dynamic) the inner layers makes for the 3d effect (purely visual sprites).</p>\n<p>magic is in the cubic-bezier curve defined by four parameters, 2:2, time:position states. inside and outside parts are synced. we use colored svg paths so we can switch the colors up easily. keyframes to smooth and delineate our angles.</p>",
				"content_text": "beware dizziness\n\n<!--more-->\n\n<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"Gate of Time SVG + CSS\" src=\"https://codepen.io/mapsdkhsd/embed/GRYwRBM/682f182c2db4dbd9e14ec35bad2595fc?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\n  spinning thing explanation\n</iframe>\n\nrelatively easy,\n\nthere's an outer main ring and an inside portion. positioning (hard-coded, but not too hard to make dynamic) the inner layers makes for the 3d effect (purely visual sprites). \n\nmagic is in the cubic-bezier curve defined by four parameters, 2:2, time:position states. inside and outside parts are synced. we use colored svg paths so we can switch the colors up easily. keyframes to smooth and delineate our angles.\n",
				"date_published": "2023-05-18T23:07:36-04:00",
				"url": "https://jze.ng/2023/05/18/beware-dizziness.html",
				"tags": ["code"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/18/httpsjzenguploadsdaehtml.html",
				
				"content_html": "<p>testing out private posts</p>\n<p>link below:</p>\n<p><a href=\"https://jze.ng/uploads/2023/8d3a9239e3.html\" target=\"_blank\">image of me&hellip; :p</a></p>\n<p>it is an encrypted, self-contained (no external dependencies) HTML file containing the ciphertext, initialization vector, and salt needed for decryption using the Argon2 key derivation function.</p>\n<p>possible future uses are personal uploads of passwords or texts like my social security or login details, passport photos, secure file transfers, pictures of stuff&hellip;, private journal entries, personal writing, etc.</p>\n<p>it will be accessible from anywhere with internet access. easily accessible, but still immensely secure.</p>\n",
				"content_text": "testing out private posts\n\nlink below:\n\n<a href=\"https://jze.ng/uploads/2023/8d3a9239e3.html\" target=\"_blank\">image of me... :p</a>\n\nit is an encrypted, self-contained (no external dependencies) HTML file containing the ciphertext, initialization vector, and salt needed for decryption using the Argon2 key derivation function. \n\npossible future uses are personal uploads of passwords or texts like my social security or login details, passport photos, secure file transfers, pictures of stuff..., private journal entries, personal writing, etc.\n\nit will be accessible from anywhere with internet access. easily accessible, but still immensely secure.\n",
				"date_published": "2023-05-18T22:54:26-04:00",
				"url": "https://jze.ng/2023/05/18/httpsjzenguploadsdaehtml.html",
				"tags": ["code","private"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/18/162336.html",
				
				"content_html": "<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"Gate of Time SVG + CSS\" src=\"https://codepen.io/mapsdkhsd/embed/dyggEBy/e603d3aab794be95fc38019e64fdaae2?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\n  vroom goes beautiful geometry\n</iframe>\n",
				"content_text": "<iframe height=\"300\" style=\"width: 100%;\" scrolling=\"no\" title=\"Gate of Time SVG + CSS\" src=\"https://codepen.io/mapsdkhsd/embed/dyggEBy/e603d3aab794be95fc38019e64fdaae2?default-tab=result&theme-id=45423\" frameborder=\"no\" loading=\"lazy\" allowtransparency=\"true\" allowfullscreen=\"true\">\n  vroom goes beautiful geometry\n</iframe>\n",
				"date_published": "2023-05-18T16:23:36-04:00",
				"url": "https://jze.ng/2023/05/18/162336.html",
				"tags": ["code"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/18/posts-are-now.html",
				"title": "site refresh",
				"content_html": "<p>content deleted and site redone. again&hellip;</p>\n<p>for the last time though.</p>\n<p>posts are now saved to the wayback machine (internet archive) as well as automatically updated to one of my github repos.</p>\n<p>i.e., no more permanent deletion</p>\n<p>until an asteroid,   <br>\njohnny</p>",
				"content_text": "content deleted and site redone. again...\n\n<!--more-->\n\nfor the last time though. \n\nposts are now saved to the wayback machine (internet archive) as well as automatically updated to one of my github repos. \n\ni.e., no more permanent deletion\n\nuntil an asteroid,      \njohnny\n",
				"date_published": "2023-05-18T14:20:22-04:00",
				"url": "https://jze.ng/2023/05/18/posts-are-now.html",
				"tags": ["misc"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/18/the-author-thought.html",
				
				"content_html": "<p>the author thought of the next word <br>\nhim and autocomplete concurred<br>\nthe artist put up a blank canvas <br>\nthe generative ai left it spotless<br>\nthe woman applied for a loan <br>\ntwo bytes, &ldquo;no&rdquo;  <br>\nthe people yelled in defiance <br>\nthe drone left only silence</p>\n",
				"content_text": "the author thought of the next word    \nhim and autocomplete concurred   \nthe artist put up a blank canvas    \nthe generative ai left it spotless   \nthe woman applied for a loan    \ntwo bytes, \"no\"     \nthe people yelled in defiance    \nthe drone left only silence\n",
				"date_published": "2023-05-18T12:51:30-04:00",
				"url": "https://jze.ng/2023/05/18/the-author-thought.html",
				"tags": ["poetry"]
			},
			{
				"id": "http://rushhour.micro.blog/2023/05/18/physics-isnt-the.html",
				
				"content_html": "<blockquote>\n<p>“Physics isn&rsquo;t the most important thing. Love is.”</p>\n<p>― <cite>Richard P. Feynman</cite></p>\n</blockquote>\n",
				"content_text": "> “Physics isn't the most important thing. Love is.”\n>\n> ― <cite>Richard P. Feynman</cite>\n",
				"date_published": "2023-05-18T12:40:40-04:00",
				"url": "https://jze.ng/2023/05/18/physics-isnt-the.html",
				"tags": ["quotes"]
			}
	]
}
